-- ----------------------------
-- 城市表
-- ----------------------------
INSERT INTO `city_code` VALUES (null, '000000', '全国', '全国', '1', null);
INSERT INTO `city_code` VALUES (null, '310000', '上海', '上海市', '1', null);
INSERT INTO `city_code` VALUES (null, '440100', '广州', '广州市', '2', '440000');
INSERT INTO `city_code` VALUES (null, '330100', '杭州', '杭州市', '2', '330000');
INSERT INTO `city_code` VALUES (null, '310100', '上海', '上海市(市辖区)', '2', '310000');
INSERT INTO `city_code` VALUES (null, '440000', '广东', '广东省', '1', null);
INSERT INTO `city_code` VALUES (null, '330000', '浙江', '浙江省', '1', null);


-- ----------------------------
-- 序列表
-- ----------------------------
INSERT INTO `sequence` VALUES ('USER_ID', '35', '1');


-- ----------------------------
-- um机构信息表
-- ----------------------------
INSERT INTO `um_group_info` VALUES (null, '1000000001', '上海宏获资产管理有限公司', '宏获资产', 'HH', null, '1', null, '01', '310100', '2017-07-03 16:58:58', '2017-07-04 18:28:48', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000002', '上海宏获资产管理有限公司风控部', '风控部', '', '2017070316580000000001', '1', null, '02', '310100', '2017-07-03 16:58:58', '2017-07-04 18:28:48', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000003', '上海宏获资产管理有限公司金融市场部', '金融市场部', '', '2017070316580000000001', '1', null, '02', '310100', '2017-07-03 16:58:58', '2017-07-04 18:28:48', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000004', '上海宏获资产管理有限公司人事行政部', '人事行政部', '', '2017070316580000000001', '1', null, '02', '310100', '2017-07-03 16:58:58', '2017-07-04 18:28:48', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000005', '上海宏获资产管理有限公司资产部', '资产部', '', '2017070316580000000001', '1', null, '02', '310100', '2017-07-03 16:58:58', '2017-07-04 18:28:48', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000006', '上海宏获资产管理有限公司金融科技部', '金融科技部', '', '2017070316580000000001', '1', null, '02', '310100', '2017-07-03 16:58:58', '2017-07-04 18:28:48', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000007', '上海宏获资产管理有限公司财务部', '财务部', '', '2017070316580000000001', '1', null, '02', '310100', '2017-07-03 16:58:58', '2017-07-04 18:28:48', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000008', '上海宏获资产管理有限公司运营部', '运营部', '', '2017070316580000000001', '1', null, '02', '310100', '2017-07-03 16:58:58', '2017-07-04 18:28:48', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000009', '上海宏获资产管理有限公司合规管理部', '合规管理部', '', '2017070316580000000001', '1', null, '02', '310100', '2017-07-03 16:58:58', '2017-07-04 18:28:48', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000010', '上海宏获资产管理有限公司杭州', '宏获杭州', '', '2017070316580000000001', '1', null, '03', '330100', '2017-07-03 16:58:58', '2017-07-04 18:29:05', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000011', '上海宏获资产管理有限公司广州', '宏获广州', '', '2017070316580000000001', '1', null, '03', '440100', '2017-07-03 16:58:58', '2017-07-04 18:29:18', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000100', '北京房袋袋信息科技有限公司', '房袋袋', 'FDD', '2017070316580000000001', '1', null, '04', '310100', '2017-07-03 16:58:58', '2017-07-04 18:28:48', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000101', '北京红鼻子信息科技有限公司', '红鼻子', 'HBZ', '2017070316580000000001', '1', null, '04', '310100', '2017-07-03 16:58:58', '2017-07-04 18:28:48', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000200', '上海庭睿金融服务有限公司', '庭睿', 'TR', '', '1', null, '04', '310100', '2017-07-03 16:58:58', '2017-07-04 18:28:48', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000201', '上海大实代金融信息服务有限公司', '大实代', 'DSD', '', '1', null, '04', '310100', '2017-07-03 16:58:58', '2017-07-04 18:28:48', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000202', '上海合盘金融信息服务股份有限公司', '合盘', 'HP', '', '1', null, '04', '310100', '2017-07-03 16:58:58', '2017-07-04 18:28:48', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000203', '上海瀚匠金融信息服务有限公司', '瀚匠', 'HJ', '', '1', null, '04', '310100', '2017-07-03 16:58:58', '2017-07-04 18:28:48', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000204', '上海融笃资产管理有限公司', '口袋', 'KD', '', '1', null, '04', '310100', '2017-07-03 16:58:58', '2017-07-04 18:28:48', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000205', '上海盈旺金融信息服务有限公司', '盈旺', 'YW', '', '1', null, '04', '310100', '2017-07-03 16:58:58', '2017-07-04 18:28:48', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000206', '上海质隆资产管理有限公司', '质隆', 'ZL', '', '1', null, '04', '310100', '2017-07-03 16:58:58', '2017-07-04 18:28:49', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000207', '上海舟凯投资管理有限公司', '舟凯', 'ZK', '', '1', null, '04', '310100', '2017-07-03 16:58:58', '2017-07-04 18:28:49', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000208', '上海百丰金融服务有限公司', '百丰', 'BF', '', '1', null, '04', '310100', '2017-07-03 16:58:58', '2017-07-04 18:28:49', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000209', '上海首壹财富金融信息服务有限公司', '首壹', 'SY', '', '1', null, '04', '310100', '2017-07-03 16:58:58', '2017-07-04 18:28:49', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000210', '上海艺匠金融信息服务有限公司', '房帮客', 'FBK', '', '1', null, '04', '310100', '2017-07-03 16:58:58', '2017-07-04 18:28:49', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000211', '上海暮晓资产管理有限公司', '暮晓', 'MX', '', '1', null, '04', '310100', '2017-07-03 16:58:58', '2017-07-04 18:28:49', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000212', '上海泓叶资产管理有限公司', '泓叶', 'HY', '', '1', null, '04', '310100', '2017-07-03 16:58:58', '2017-07-04 18:28:49', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000213', '上海翊滔商务信息咨询有限公司', '阳光金服', 'YGJF', '', '1', null, '04', '310100', '2017-07-03 16:58:58', '2017-07-04 18:28:49', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000214', '上海翔胤资产管理有限公司', '翔胤', 'XY', '', '1', null, '04', '310100', '2017-07-03 16:58:58', '2017-07-04 18:28:49', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000215', '上海盛岭投资中心', '盛岭', 'SL', '', '1', null, '04', '310100', '2017-07-03 16:58:58', '2017-07-04 18:28:49', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000216', '上海陇郦实业发展有限公司', '贷管家', 'DGJ', '', '1', null, '04', '310100', '2017-07-03 16:58:58', '2017-07-04 18:28:49', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000217', '大房东（上海）金融科技有限公司', '大房东', 'DFD', '', '1', null, '04', '310100', '2017-07-03 16:58:58', '2017-07-04 18:28:49', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000218', '卜子资产管理（上海）有限公司', '卜子', 'BZ', '', '1', null, '04', '310100', '2017-07-03 16:58:58', '2017-07-04 18:28:49', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000219', '美豫投资（上海）有限公司', '快快贷', 'KKD', '', '1', null, '04', '310100', '2017-07-03 16:58:58', '2017-07-04 18:28:49', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000220', '上海纷泰信息科技有限公司', '雷驰', 'LC', '', '1', null, '04', '310100', '2017-07-03 16:58:58', '2017-07-04 18:28:49', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000221', '上海诺民金融信息服务有限公司', '诺民', 'NM', '', '1', null, '04', '310100', '2017-07-03 16:58:58', '2017-07-04 18:28:49', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000222', '上海银彭投资管理有限公司', '银彭', 'YP', '', '1', null, '04', '310100', '2017-07-03 16:58:58', '2017-07-04 18:28:49', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000223', '上海瑞钰金融信息服务有限公司', '瑞钰', 'RY', '', '1', null, '04', '310100', '2017-07-03 16:58:58', '2017-07-04 18:28:49', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000224', '上海熠岑金融信息服务有限公司', '熠岑金融', 'YCJR', '', '1', null, '04', '310100', '2017-07-03 16:58:58', '2017-07-04 18:28:49', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000225', '上海今融互联网科技有限公司', '今融', 'JR', '', '1', null, '04', '310100', '2017-07-03 16:58:58', '2017-07-04 18:28:49', '', null);
INSERT INTO `um_group_info` VALUES (null, '1000000226', '上海如亨金融信息服务有限公司', '如亨', 'RH', '', '1', null, '04', '310100', '2017-07-03 16:58:58', '2017-07-04 18:28:49', '', null);




-- ----------------------------
-- um菜单信息表
-- ----------------------------
INSERT INTO `um_menu_info` VALUES ('20', '2017070315180000000001', '首页', null, '1', '进件系统首页', './main', 'nlbs', '2017-07-03 14:10:36', '2017-07-05 03:29:45', null, null);
INSERT INTO `um_menu_info` VALUES ('21', '2017070315180000000002', '询价管理', null, '1', '进件系统询价管理', null, 'nlbs', '2017-07-03 14:10:36', '2017-07-03 17:00:43', null, null);
INSERT INTO `um_menu_info` VALUES ('22', '2017070315180000000003', '自动询价', '2017070315180000000002', '1', '进件系统自动询价', './enquiry', 'nlbs', '2017-07-03 14:10:36', '2017-07-05 03:29:53', null, null);
INSERT INTO `um_menu_info` VALUES ('23', '2017070315180000000004', '人工询价', '2017070315180000000002', '1', '进件系统人工询价', './personEnquiry', 'nlbs', '2017-07-03 14:10:36', '2017-07-05 03:29:57', null, null);
INSERT INTO `um_menu_info` VALUES ('24', '2017070315180000000005', '询价查询', '2017070315180000000002', '1', '进件系统询价列表查询', './enquirySearch', 'nlbs', '2017-07-03 14:10:36', '2017-07-05 03:30:01', null, null);
INSERT INTO `um_menu_info` VALUES ('25', '2017070315180000000006', '进件管理', '', '1', '进件系统进件管理', null, 'nlbs', '2017-07-03 14:10:36', '2017-07-03 17:00:49', null, null);
INSERT INTO `um_menu_info` VALUES ('26', '2017070315180000000007', '进件申请提交', '2017070315180000000006', '1', '进件系统提交新进件', './apply', 'nlbs', '2017-07-03 14:10:36', '2017-07-05 03:30:07', null, null);
INSERT INTO `um_menu_info` VALUES ('27', '2017070315180000000008', '进件申请查询', '2017070315180000000006', '1', '进件系统查询进件列表', './query', 'nlbs', '2017-07-03 14:10:36', '2017-07-05 03:30:16', null, null);
INSERT INTO `um_menu_info` VALUES ('28', '2017070315180000000009', '个人中心', '', '1', '进件系统用户中心', null, 'nlbs', '2017-07-03 14:10:36', '2017-07-03 17:00:54', null, null);
INSERT INTO `um_menu_info` VALUES ('29', '2017070315180000000010', '待办任务', '2017070315180000000009', '1', '进件系统待用户处理任务', './gtasks', 'nlbs', '2017-07-03 14:10:36', '2017-07-05 03:30:21', null, null);
INSERT INTO `um_menu_info` VALUES ('30', '2017070315180000000011', '消息通知', '2017070315180000000009', '1', '进件系统用户接收到的消息', './message', 'nlbs', '2017-07-03 14:10:36', '2017-07-05 03:30:24', null, null);
INSERT INTO `um_menu_info` VALUES ('31', '2017070315180000000012', '修改密码', '2017070315180000000009', '1', '进件系统用户修改密码', './enquirySearch', 'nlbs', '2017-07-03 14:10:36', '2017-07-05 03:30:27', null, null);



-- ----------------------------
-- um角色菜单关系表
-- ----------------------------
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000001', '2017063014440000000001', '1', '2017-07-03 17:55:57', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000002', '2017063014440000000001', '1', '2017-07-03 17:55:57', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000003', '2017063014440000000001', '1', '2017-07-03 17:55:57', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000004', '2017063014440000000001', '1', '2017-07-03 17:55:57', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000005', '2017063014440000000001', '1', '2017-07-03 17:55:57', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000006', '2017063014440000000001', '1', '2017-07-03 17:55:57', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000007', '2017063014440000000001', '1', '2017-07-03 17:55:57', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000008', '2017063014440000000001', '1', '2017-07-03 17:55:57', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000009', '2017063014440000000001', '1', '2017-07-03 17:55:57', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000010', '2017063014440000000001', '1', '2017-07-03 17:55:57', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000011', '2017063014440000000001', '1', '2017-07-03 17:55:57', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000012', '2017063014440000000001', '1', '2017-07-03 17:55:57', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000001', '2017063014440000000002', '1', '2017-07-03 17:58:35', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000002', '2017063014440000000002', '1', '2017-07-03 17:58:35', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000003', '2017063014440000000002', '1', '2017-07-03 17:58:35', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000004', '2017063014440000000002', '1', '2017-07-03 17:58:35', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000005', '2017063014440000000002', '1', '2017-07-03 17:58:35', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000006', '2017063014440000000002', '1', '2017-07-03 17:58:35', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000007', '2017063014440000000002', '1', '2017-07-03 17:58:35', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000008', '2017063014440000000002', '1', '2017-07-03 17:58:35', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000009', '2017063014440000000002', '1', '2017-07-03 17:58:35', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000010', '2017063014440000000002', '1', '2017-07-03 17:58:35', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000011', '2017063014440000000002', '1', '2017-07-03 17:58:35', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000012', '2017063014440000000002', '1', '2017-07-03 17:58:35', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000001', '2017063014440000000003', '1', '2017-07-03 18:02:18', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000002', '2017063014440000000003', '1', '2017-07-03 18:02:18', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000005', '2017063014440000000003', '1', '2017-07-03 18:02:18', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000006', '2017063014440000000003', '1', '2017-07-03 18:02:18', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000008', '2017063014440000000003', '1', '2017-07-03 18:02:18', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000009', '2017063014440000000003', '1', '2017-07-03 18:02:18', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000010', '2017063014440000000003', '1', '2017-07-03 18:02:18', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000011', '2017063014440000000003', '1', '2017-07-03 18:02:18', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000012', '2017063014440000000003', '1', '2017-07-03 18:02:18', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000001', '2017063014440000000004', '1', '2017-07-03 18:04:38', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000002', '2017063014440000000004', '1', '2017-07-03 18:04:38', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000005', '2017063014440000000004', '1', '2017-07-03 18:04:38', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000009', '2017063014440000000004', '1', '2017-07-03 18:04:38', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000010', '2017063014440000000004', '1', '2017-07-03 18:04:39', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000011', '2017063014440000000004', '1', '2017-07-03 18:04:39', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000012', '2017063014440000000004', '1', '2017-07-03 18:04:39', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000001', '2017063014440000000005', null, '2017-07-03 18:06:13', '2017-07-03 18:06:13', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000009', '2017063014440000000005', null, '2017-07-03 18:06:13', '2017-07-03 18:06:13', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000010', '2017063014440000000005', null, '2017-07-03 18:06:13', '2017-07-03 18:06:13', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000011', '2017063014440000000005', null, '2017-07-03 18:06:13', '2017-07-03 18:06:13', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000012', '2017063014440000000005', null, '2017-07-03 18:06:13', '2017-07-03 18:06:13', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000001', '2017063014440000000006', null, '2017-07-03 18:06:42', '2017-07-03 18:06:42', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000009', '2017063014440000000006', null, '2017-07-03 18:06:42', '2017-07-03 18:06:42', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000010', '2017063014440000000006', null, '2017-07-03 18:06:42', '2017-07-03 18:06:42', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000011', '2017063014440000000006', null, '2017-07-03 18:06:42', '2017-07-03 18:06:42', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000012', '2017063014440000000006', null, '2017-07-03 18:06:42', '2017-07-03 18:06:42', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000001', '2017063014440000000007', null, '2017-07-03 18:07:20', '2017-07-03 18:07:20', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000009', '2017063014440000000007', null, '2017-07-03 18:07:20', '2017-07-03 18:07:20', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000010', '2017063014440000000007', null, '2017-07-03 18:07:20', '2017-07-03 18:07:20', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000011', '2017063014440000000007', null, '2017-07-03 18:07:20', '2017-07-03 18:07:20', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000012', '2017063014440000000007', null, '2017-07-03 18:07:20', '2017-07-03 18:07:20', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000001', '2017063014440000000008', null, '2017-07-03 18:09:04', '2017-07-03 18:09:04', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000006', '2017063014440000000008', null, '2017-07-03 18:09:04', '2017-07-03 18:09:04', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000008', '2017063014440000000008', null, '2017-07-03 18:09:04', '2017-07-03 18:09:04', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000009', '2017063014440000000008', null, '2017-07-03 18:09:04', '2017-07-03 18:09:04', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000010', '2017063014440000000008', null, '2017-07-03 18:09:04', '2017-07-03 18:09:04', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000011', '2017063014440000000008', null, '2017-07-03 18:09:04', '2017-07-03 18:09:04', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000012', '2017063014440000000008', null, '2017-07-03 18:09:04', '2017-07-03 18:09:04', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000001', '2017063014440000000009', null, '2017-07-03 18:09:52', '2017-07-03 18:09:52', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000006', '2017063014440000000009', null, '2017-07-03 18:09:52', '2017-07-03 18:09:52', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000007', '2017063014440000000009', null, '2017-07-03 18:09:52', '2017-07-03 18:09:52', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000008', '2017063014440000000009', null, '2017-07-03 18:09:52', '2017-07-03 18:09:52', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000009', '2017063014440000000009', null, '2017-07-03 18:09:52', '2017-07-03 18:09:52', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000010', '2017063014440000000009', null, '2017-07-03 18:09:52', '2017-07-03 18:09:52', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000011', '2017063014440000000009', null, '2017-07-03 18:09:52', '2017-07-03 18:09:52', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000012', '2017063014440000000009', null, '2017-07-03 18:09:53', '2017-07-03 18:09:53', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000002', '2017063014440000000010', null, '2017-07-03 18:10:52', '2017-07-03 18:10:52', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000003', '2017063014440000000010', null, '2017-07-03 18:10:52', '2017-07-03 18:10:52', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000004', '2017063014440000000010', null, '2017-07-03 18:10:52', '2017-07-03 18:10:52', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000005', '2017063014440000000010', null, '2017-07-03 18:10:52', '2017-07-03 18:10:52', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000002', '2017063014440000000011', null, '2017-07-03 18:11:24', '2017-07-03 18:11:24', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000003', '2017063014440000000011', null, '2017-07-03 18:11:24', '2017-07-03 18:11:24', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000004', '2017063014440000000011', null, '2017-07-03 18:11:24', '2017-07-03 18:11:24', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017070315180000000005', '2017063014440000000011', null, '2017-07-03 18:11:24', '2017-07-03 18:11:24', null, null);

-- ----------------------------
-- um角色信息表
-- ----------------------------
INSERT INTO `um_role_info` VALUES (null, '2017063014440000000001', '超级管理员', '1', '超级管理员', 'nlbs', '2017-06-30 14:45:36', '2017-07-03 17:01:18', null, null);
INSERT INTO `um_role_info` VALUES (null, '2017063014440000000002', '系统管理员', '1', '系统管理员', 'nlbs', '2017-06-30 14:45:36', '2017-07-03 17:01:23', null, null);
INSERT INTO `um_role_info` VALUES (null, '2017063014440000000003', '公司管理', '1', '公司管理', 'nlbs', '2017-06-30 14:45:36', '2017-07-03 17:01:25', null, null);
INSERT INTO `um_role_info` VALUES (null, '2017063014440000000004', '风控管理', '1', '风控管理', 'nlbs', '2017-06-30 14:45:36', '2017-07-03 17:01:26', null, null);
INSERT INTO `um_role_info` VALUES (null, '2017063014440000000005', '风控初审', '1', '风控初审', 'nlbs', '2017-06-30 14:45:36', '2017-07-03 17:01:28', null, null);
INSERT INTO `um_role_info` VALUES (null, '2017063014440000000006', '风控复审', '1', '风控复审', 'nlbs', '2017-06-30 14:45:36', '2017-07-03 17:01:29', null, null);
INSERT INTO `um_role_info` VALUES (null, '2017063014440000000007', '风控终审', '1', '风控终审', 'nlbs', '2017-06-30 14:45:36', '2017-07-03 17:01:31', null, null);
INSERT INTO `um_role_info` VALUES (null, '2017063014440000000008', '渠道管理', '1', '渠道管理', 'nlbs', '2017-06-30 14:45:36', '2017-07-03 17:01:32', null, null);
INSERT INTO `um_role_info` VALUES (null, '2017063014440000000009', '渠道经理', '1', '渠道经理', 'nlbs', '2017-06-30 14:45:36', '2017-07-03 17:01:34', null, null);
INSERT INTO `um_role_info` VALUES (null, '2017063014440000000010', '询价管理', '1', '询价管理', 'nlbs', '2017-06-30 14:45:36', '2017-07-03 17:01:35', null, null);
INSERT INTO `um_role_info` VALUES (null, '2017063014440000000011', '询价查询', '1', '询价查询', 'nlbs', '2017-06-30 14:45:36', '2017-07-03 17:01:38', null, null);

-- ----------------------------
-- um系统信息表
-- ----------------------------
INSERT INTO `um_system_info` VALUES ('3', 'nlbs', '新进件系统', '1', '', '2017-06-30 15:53:26', '2017-06-30 15:53:26', null, null);


-- ----------------------------
-- um用户信息表
-- ----------------------------
INSERT INTO `um_user_info` VALUES (null, '2017063015180000000001', null, '310100', '13802926519', '8698206a728eed045d1cdce7f86b1787', 'caichao@vilio.com.cn', null, '1', '1', '蔡超', '1', null, null, null, null, '', '0', '1', '1000000001', null, null, '2017-06-30 15:52:09', '2017-07-04 09:44:05', null, null);
INSERT INTO `um_user_info` VALUES (null, '2017063015180000000002', null, '310100', '13968505268', '0d0e933b82cbbaaee3e421528cd01d20', 'vincent.bao@vilio.com.cn', null, '1', '1', '鲍龙', '1', null, null, null, null, '', '0', '1', '1000000005', '2017063015180000000001', null, '2017-06-30 15:52:09', '2017-07-04 09:44:05', null, null);
INSERT INTO `um_user_info` VALUES (null, '2017063015180000000003', null, '310100', '13636321925', 'a1ffa9662a8c884ba3c90a4c6d0cd400', 'wei.ma@vilio.com.cn', null, '1', '1', '马伟', '1', null, null, null, null, '', '0', '1', '1000000005', '2017063015180000000002', null, '2017-06-30 15:52:09', '2017-07-04 09:44:05', null, null);
INSERT INTO `um_user_info` VALUES (null, '2017063015180000000004', null, '310100', '15001839495', 'debb49dda35b8cf519d1e91318919493', 'qingtao.li@vilio.com.cn', null, '1', '1', '李庆涛', '1', null, null, null, null, '', '0', '1', '1000000005', '2017063015180000000003', null, '2017-06-30 15:52:09', '2017-07-04 09:44:05', null, null);
INSERT INTO `um_user_info` VALUES (null, '2017063015180000000005', null, '310100', '18512122125', '24b5ce50d4ad2dfebe74542b79df271f', 'eason.zhang@vilio.com.cn', null, '1', '1', '张毅', '1', null, null, null, null, '', '0', '1', '1000000005', '2017063015180000000003', null, '2017-06-30 15:52:10', '2017-07-04 09:44:05', null, null);
INSERT INTO `um_user_info` VALUES (null, '2017063015180000000006', null, '310100', '13681808060', '34ea9d2abe36806b9ec7d11b7480eb94', 'yangyang.xiong@vilio.com.cn', null, '1', '1', '熊杨阳', '0', null, null, null, null, '', '0', '1', '1000000005', '2017063015180000000003', null, '2017-06-30 15:52:10', '2017-07-04 09:44:05', null, null);
INSERT INTO `um_user_info` VALUES (null, '2017063015180000000007', null, '310100', '15900992562', '343f33771ae8a8dcc35d5d7d3e2071b4', 'junyan.lu@vilio.com.cn', null, '1', '1', '卢俊彦', '1', null, null, null, null, '', '0', '1', '1000000002', '2017063015180000000001', null, '2017-06-30 15:52:10', '2017-07-04 09:44:05', null, null);
INSERT INTO `um_user_info` VALUES (null, '2017063015180000000008', null, '310100', '13817403697', '2d683091de8e00965a67018d5ad1698a', 'lina.cao@vilio.com.cn', null, '1', '1', '曹丽娜', '0', null, null, null, null, '', '0', '1', '1000000002', '2017063015180000000007', null, '2017-06-30 15:52:10', '2017-07-04 09:44:05', null, null);
INSERT INTO `um_user_info` VALUES (null, '2017063015180000000009', null, '310100', '13023209032', '9408885e509ee82189b10f5b153e4114', 'ya.tang@vilio.com.cn', null, '1', '1', '汤娅', '0', null, null, null, null, '', '0', '1', '1000000002', '2017063015180000000007', null, '2017-06-30 15:52:11', '2017-07-04 09:44:05', null, null);
INSERT INTO `um_user_info` VALUES (null, '2017063015180000000010', null, '310100', '13918552313', '8a9126f9a507dfe3e80cfadcb8ef952d', 'xin.xu@vilio.com.cn', null, '1', '1', '许昕', '1', null, null, null, null, '', '0', '1', '1000000002', '2017063015180000000007', null, '2017-06-30 15:52:11', '2017-07-04 09:44:05', null, null);
INSERT INTO `um_user_info` VALUES (null, '2017063015180000000011', null, '310100', '18721396548', 'ebb1113b98f3d7d8a4ec302c68c35fe6', 'linguang.yang@vilio.com.cn', null, '1', '1', '杨林光', '1', null, null, null, null, '', '0', '1', '1000000002', '2017063015180000000007', null, '2017-06-30 15:52:11', '2017-07-04 09:44:05', null, null);
INSERT INTO `um_user_info` VALUES (null, '2017063015180000000012', null, '310100', '18757611028', '761ec698a36f45463a41b2bed6d7ca00', 'linya.peng@vilio.com.cn', null, '1', '1', '彭琳雅', '0', null, null, null, null, '', '0', '1', '1000000002', '2017063015180000000007', null, '2017-06-30 15:52:12', '2017-07-04 09:44:05', null, null);
INSERT INTO `um_user_info` VALUES (null, '2017063015180000000013', null, '310100', '13381908205', 'd9f12429d529fdaa4d0ca49713c744ed', 'yuxiao.wang@vilio.com.cn', null, '1', '1', '王宇霄', '1', null, null, null, null, '', '0', '1', '1000000002', '2017063015180000000007', null, '2017-06-30 15:52:12', '2017-07-04 09:44:05', null, null);
INSERT INTO `um_user_info` VALUES (null, '2017063015180000000014', null, '310100', '18721176924', '5e21a263056e2d1f7f0ca1f2556c735b', 'given.wu@vilio.com.cn', null, '1', '1', '武舸', '1', null, null, null, null, '', '0', '1', '1000000002', '2017063015180000000007', null, '2017-06-30 15:52:12', '2017-07-04 09:44:05', null, null);
INSERT INTO `um_user_info` VALUES (null, '2017063015180000000015', null, '310100', '15801866956', '94fb3e514e24d35e4a36c536df956000', 'song.wu@vilio.com.cn', null, '1', '1', '吴松', '1', null, null, null, null, '', '0', '1', '1000000002', '2017063015180000000007', null, '2017-06-30 15:52:12', '2017-07-04 09:44:05', null, null);
INSERT INTO `um_user_info` VALUES (null, '2017063015180000000016', null, '310100', '13764103363', 'd88171d8e2ed073b45883e69532b71d8', 'linguang.yang@vilio.com.cn', null, '1', '1', '邵伟康', '1', null, null, null, null, '', '0', '1', '1000000002', '2017063015180000000007', null, '2017-06-30 15:52:13', '2017-07-04 09:44:05', null, null);
INSERT INTO `um_user_info` VALUES (null, '2017063015180000000017', null, '310100', '18616774571', '09b34bd4f1271273320c725315b1c4cc', 'guowei.jiang@vilio.com.cn', null, '1', '1', '蒋国炜', '1', null, null, null, null, '', '0', '1', '1000000002', '2017063015180000000007', null, '2017-06-30 15:52:13', '2017-07-04 09:44:05', null, null);
INSERT INTO `um_user_info` VALUES (null, '2017063015180000000018', null, '310100', '18512105234', '99110751c524f016d0d9e7723a469c9c', 'simon.tang@vilio.com.cn', null, '1', '1', '唐庆龙', '1', null, null, null, null, '', '0', '1', '1000000008', '2017063015180000000001', null, '2017-06-30 15:52:13', '2017-07-04 09:44:05', null, null);
INSERT INTO `um_user_info` VALUES (null, '2017063015180000000019', null, '440100', '18028628328', 'd77324d7ae72335124624b2aeec9f717', 'shuangyou.li@vilio.com.cn', null, '1', '1', '李双有', '1', null, null, null, null, '', '0', '1', '1000000011', '2017063015180000000002', null, '2017-06-30 15:52:13', '2017-07-04 09:44:05', null, null);
INSERT INTO `um_user_info` VALUES (null, '2017063015180000000020', null, '440100', '13642773943', 'd7d99b6f4f21de6b65629b3e26d437d7', 'jiancong.qu@vilio.com.cn', null, '1', '1', '屈建聪', '1', null, null, null, null, '', '0', '1', '1000000011', '2017063015180000000019', null, '2017-06-30 15:52:13', '2017-07-04 09:44:05', null, null);
INSERT INTO `um_user_info` VALUES (null, '2017063015180000000021', null, '440100', '15914375421', '935156aa6a60e61b8105984c5d03ecf4', 'weidong.huang@vilio.com.cn', null, '1', '1', '黄伟东', '1', null, null, null, null, '', '0', '1', '1000000011', '2017063015180000000007', null, '2017-06-30 15:52:13', '2017-07-04 09:44:05', null, null);
INSERT INTO `um_user_info` VALUES (null, '2017063015180000000022', null, '440100', '15989219915', '01f345f3115f7111c2b6f2645666fb48', 'lu.jiang@vilio.com.cn', null, '1', '1', '江露', '0', null, null, null, null, '', '0', '1', '1000000011', '2017063015180000000018', null, '2017-06-30 15:52:13', '2017-07-04 09:44:05', null, null);
INSERT INTO `um_user_info` VALUES (null, '2017063015180000000023', null, '440100', '13922235049', '0a87a0bc39fdaa262ed7bacb9a7e53a1', '', null, '1', '1', '李鉴培', '1', null, null, null, null, '', '0', '1', '1000000011', '2017063015180000000021', null, '2017-06-30 15:52:14', '2017-07-04 09:44:05', null, null);
INSERT INTO `um_user_info` VALUES (null, '2017063015180000000025', null, '310100', '15601936981', '044147f09b5c29bf6587058359293e5f', 'layne.xie@vilio.com.cn', null, '1', '1', '谢之磊', '1', null, null, null, null, '', '0', '1', '1000000006', '2017063015180000000024', null, '2017-06-30 15:57:45', '2017-07-04 09:44:05', null, null);
INSERT INTO `um_user_info` VALUES (null, '2017063015180000000026', null, '310100', '17721198476', '9a0738f088c46b823ca8c6a48ddf1144', 'martin.xing@vilio.com.cn', null, '1', '1', '幸炜', '1', null, null, null, null, '', '0', '1', '1000000006', '2017063015180000000024', null, '2017-06-30 15:57:45', '2017-07-04 09:44:05', null, null);
INSERT INTO `um_user_info` VALUES (null, '2017063015180000000027', null, '310100', '15206117987', 'a4977e35e9dc6846a4d20b618cab5ba1', 'yi.zhang@vilio.com.cn', null, '1', '1', '张一', '1', null, null, null, null, '', '0', '1', '1000000006', '2017063015180000000024', null, '2017-06-30 15:57:45', '2017-07-04 09:44:05', null, null);
INSERT INTO `um_user_info` VALUES (null, '2017063015180000000024', null, '310100', '18621783163', '118800b95747fe0b10db7d11b9bbfabf', 'joel.lin@vilio.com.cn', null, '1', '1', '林兆', '1', null, null, null, null, '', '0', '1', '1000000006', '2017063015180000000001', null, '2017-06-30 16:08:09', '2017-07-04 09:44:05', null, null);



-- ----------------------------
-- um系统用户角色关系表
-- ----------------------------
INSERT INTO `um_user_role` VALUES (null, '2017063015180000000001', '2017063014440000000010', '1', '2017-06-30 16:16:27', '2017-07-03 17:02:34', null, null);
INSERT INTO `um_user_role` VALUES (null, '2017063015180000000002', '2017063014440000000010', '1', '2017-06-30 16:16:27', '2017-07-03 17:02:36', null, null);
INSERT INTO `um_user_role` VALUES (null, '2017063015180000000003', '2017063014440000000010', '1', '2017-06-30 16:16:27', '2017-07-03 17:02:38', null, null);
INSERT INTO `um_user_role` VALUES (null, '2017063015180000000004', '2017063014440000000010', '1', '2017-06-30 16:16:28', '2017-07-03 17:02:40', null, null);
INSERT INTO `um_user_role` VALUES (null, '2017063015180000000005', '2017063014440000000010', '1', '2017-06-30 16:16:28', '2017-07-03 17:02:41', null, null);
INSERT INTO `um_user_role` VALUES (null, '2017063015180000000006', '2017063014440000000010', '1', '2017-06-30 16:16:28', '2017-07-03 17:02:43', null, null);
INSERT INTO `um_user_role` VALUES (null, '2017063015180000000007', '2017063014440000000010', '1', '2017-06-30 16:16:28', '2017-07-03 17:02:45', null, null);
INSERT INTO `um_user_role` VALUES (null, '2017063015180000000008', '2017063014440000000010', '1', '2017-06-30 16:16:28', '2017-07-03 17:02:46', null, null);
INSERT INTO `um_user_role` VALUES (null, '2017063015180000000009', '2017063014440000000010', '1', '2017-06-30 16:16:29', '2017-07-03 17:02:48', null, null);
INSERT INTO `um_user_role` VALUES (null, '2017063015180000000010', '2017063014440000000010', '1', '2017-06-30 16:16:30', '2017-07-03 17:02:57', null, null);
INSERT INTO `um_user_role` VALUES (null, '2017063015180000000011', '2017063014440000000010', '1', '2017-06-30 16:16:31', '2017-07-03 17:02:58', null, null);
INSERT INTO `um_user_role` VALUES (null, '2017063015180000000012', '2017063014440000000010', '1', '2017-06-30 16:16:31', '2017-07-03 17:02:58', null, null);
INSERT INTO `um_user_role` VALUES (null, '2017063015180000000013', '2017063014440000000010', '1', '2017-06-30 16:16:32', '2017-07-03 17:02:59', null, null);
INSERT INTO `um_user_role` VALUES (null, '2017063015180000000014', '2017063014440000000010', '1', '2017-06-30 16:16:33', '2017-07-03 17:03:01', null, null);
INSERT INTO `um_user_role` VALUES (null, '2017063015180000000015', '2017063014440000000010', '1', '2017-06-30 16:16:33', '2017-07-03 17:03:03', null, null);
INSERT INTO `um_user_role` VALUES (null, '2017063015180000000016', '2017063014440000000010', '1', '2017-06-30 16:16:33', '2017-07-03 17:03:04', null, null);
INSERT INTO `um_user_role` VALUES (null, '2017063015180000000017', '2017063014440000000010', '1', '2017-06-30 16:16:33', '2017-07-03 17:03:05', null, null);
INSERT INTO `um_user_role` VALUES (null, '2017063015180000000018', '2017063014440000000010', '1', '2017-06-30 16:16:33', '2017-07-03 17:03:05', null, null);
INSERT INTO `um_user_role` VALUES (null, '2017063015180000000019', '2017063014440000000010', '1', '2017-06-30 16:16:33', '2017-07-03 17:03:06', null, null);
INSERT INTO `um_user_role` VALUES (null, '2017063015180000000020', '2017063014440000000010', '1', '2017-06-30 16:16:33', '2017-07-03 17:03:07', null, null);
INSERT INTO `um_user_role` VALUES (null, '2017063015180000000021', '2017063014440000000010', '1', '2017-06-30 16:16:34', '2017-07-03 17:03:08', null, null);
INSERT INTO `um_user_role` VALUES (null, '2017063015180000000022', '2017063014440000000010', '1', '2017-06-30 16:16:34', '2017-07-03 17:03:08', null, null);
INSERT INTO `um_user_role` VALUES (null, '2017063015180000000023', '2017063014440000000010', '1', '2017-06-30 16:16:34', '2017-07-03 17:03:09', null, null);
INSERT INTO `um_user_role` VALUES (null, '2017063015180000000025', '2017063014440000000001', '1', '2017-06-30 16:16:35', '2017-07-03 17:03:13', null, null);
INSERT INTO `um_user_role` VALUES (null, '2017063015180000000026', '2017063014440000000001', '1', '2017-06-30 16:16:35', '2017-07-03 17:03:13', null, null);
INSERT INTO `um_user_role` VALUES (null, '2017063015180000000027', '2017063014440000000001', '1', '2017-06-30 16:16:35', '2017-07-03 17:03:14', null, null);
INSERT INTO `um_user_role` VALUES (null, '2017063015180000000024', '2017063014440000000001', '1', '2017-06-30 16:16:35', '2017-07-03 17:03:15', null, null);




-- ----------------------------
-- um用户系统权限表
-- ----------------------------
INSERT INTO `um_user_system` VALUES (null, '2017063015180000000001', 'nlbs', '1', '2017-06-30 15:58:11', '2017-07-03 17:03:23', null, null);
INSERT INTO `um_user_system` VALUES (null, '2017063015180000000002', 'nlbs', '1', '2017-06-30 15:58:12', '2017-07-03 17:03:25', null, null);
INSERT INTO `um_user_system` VALUES (null, '2017063015180000000003', 'nlbs', '1', '2017-06-30 15:58:12', '2017-07-03 17:03:26', null, null);
INSERT INTO `um_user_system` VALUES (null, '2017063015180000000004', 'nlbs', '1', '2017-06-30 15:58:14', '2017-07-03 17:03:28', null, null);
INSERT INTO `um_user_system` VALUES (null, '2017063015180000000005', 'nlbs', '1', '2017-06-30 15:58:18', '2017-07-03 17:03:30', null, null);
INSERT INTO `um_user_system` VALUES (null, '02017063015180000000006', 'nlbs', '1', '2017-06-30 15:58:20', '2017-07-03 17:03:38', null, null);
INSERT INTO `um_user_system` VALUES (null, '2017063015180000000007', 'nlbs', '1', '2017-06-30 15:58:20', '2017-07-03 17:03:40', null, null);
INSERT INTO `um_user_system` VALUES (null, '2017063015180000000008', 'nlbs', '1', '2017-06-30 15:58:21', '2017-07-03 17:03:41', null, null);
INSERT INTO `um_user_system` VALUES (null, '2017063015180000000009', 'nlbs', '1', '2017-06-30 15:58:21', '2017-07-03 17:03:42', null, null);
INSERT INTO `um_user_system` VALUES (null, '2017063015180000000010', 'nlbs', '1', '2017-06-30 15:58:21', '2017-07-03 17:03:44', null, null);
INSERT INTO `um_user_system` VALUES (null, '2017063015180000000011', 'nlbs', '1', '2017-06-30 15:58:22', '2017-07-03 17:03:47', null, null);
INSERT INTO `um_user_system` VALUES (null, '2017063015180000000012', 'nlbs', '1', '2017-06-30 15:58:22', '2017-07-03 17:03:48', null, null);
INSERT INTO `um_user_system` VALUES (null, '2017063015180000000013', 'nlbs', '1', '2017-06-30 15:58:23', '2017-07-03 17:03:49', null, null);
INSERT INTO `um_user_system` VALUES (null, '2017063015180000000014', 'nlbs', '1', '2017-06-30 15:58:24', '2017-07-03 17:03:51', null, null);
INSERT INTO `um_user_system` VALUES (null, '2017063015180000000015', 'nlbs', '1', '2017-06-30 15:58:24', '2017-07-03 17:03:52', null, null);
INSERT INTO `um_user_system` VALUES (null, '2017063015180000000016', 'nlbs', '1', '2017-06-30 15:58:25', '2017-07-03 17:03:54', null, null);
INSERT INTO `um_user_system` VALUES (null, '2017063015180000000017', 'nlbs', '1', '2017-06-30 15:58:25', '2017-07-03 17:03:55', null, null);
INSERT INTO `um_user_system` VALUES (null, '2017063015180000000018', 'nlbs', '1', '2017-06-30 15:58:25', '2017-07-03 17:03:57', null, null);
INSERT INTO `um_user_system` VALUES (null, '2017063015180000000019', 'nlbs', '1', '2017-06-30 15:58:26', '2017-07-03 17:03:58', null, null);
INSERT INTO `um_user_system` VALUES (null, '2017063015180000000020', 'nlbs', '1', '2017-06-30 15:58:26', '2017-07-03 17:04:00', null, null);
INSERT INTO `um_user_system` VALUES (null, '2017063015180000000021', 'nlbs', '1', '2017-06-30 15:58:30', '2017-07-03 17:04:01', null, null);
INSERT INTO `um_user_system` VALUES (null, '2017063015180000000022', 'nlbs', '1', '2017-06-30 15:58:30', '2017-07-03 17:04:03', null, null);
INSERT INTO `um_user_system` VALUES (null, '2017063015180000000023', 'nlbs', '1', '2017-06-30 15:58:31', '2017-07-03 17:04:04', null, null);
INSERT INTO `um_user_system` VALUES (null, '2017063015180000000024', 'nlbs', '1', '2017-06-30 15:58:31', '2017-07-03 17:04:05', null, null);
INSERT INTO `um_user_system` VALUES (null, '2017063015180000000025', 'nlbs', '1', '2017-06-30 15:58:31', '2017-07-03 17:04:07', null, null);
INSERT INTO `um_user_system` VALUES (null, '2017063015180000000026', 'nlbs', '1', '2017-06-30 15:58:32', '2017-07-03 17:04:08', null, null);
INSERT INTO `um_user_system` VALUES (null, '2017063015180000000027', 'nlbs', '1', '2017-06-30 15:58:32', '2017-07-03 17:04:10', null, null);


-- ----------------------------
-- 序列
-- ----------------------------
DROP FUNCTION IF EXISTS `currval`; 

DROP FUNCTION IF EXISTS `nextval`;   


DELIMITER //  
  
CREATE  FUNCTION `currval`(seq_name VARCHAR(50)) RETURNS int(11)  
  
    READS SQL DATA  
  
    DETERMINISTIC  
  
BEGIN  
  
DECLARE VALUE INTEGER;  
  
SET VALUE = 0;  
  
SELECT current_value INTO VALUE FROM sequence WHERE NAME = seq_name;  
  
RETURN VALUE;  
  
END//  
  
DELIMITER ;



  
DELIMITER //  
  
CREATE  FUNCTION `nextval`(seq_name VARCHAR(50)) RETURNS int(11)  
  
    DETERMINISTIC  
  
BEGIN  
  
UPDATE sequence SET current_value = current_value + increment WHERE NAME = seq_name;  
  
RETURN currval(seq_name);  
  
END//  
  

DELIMITER ;





