-- 增加系统

-- 增加用户
INSERT INTO `um_user_info` VALUES (null, '2017090810570000000042', null, '310100', '18616392005', md5('18616392005'), 'shitao.dong@vilio.com.cn', null, '1', '1', '董仕涛', '1', null, null, null, null, '', '0', '1', '1000000006', '2017063015180000000024', null, null, null, null, null,null);

-- 增加系统用户关系
INSERT INTO `um_user_system` VALUES (null, '2017090810570000000042', 'plms', '1', null, null, null, null);

-- 增加角色信息表
INSERT INTO `um_role_info` VALUES (null, '2017090814440000000001', '默认', '1', '默认', 'plms', null, null, null, null);
INSERT INTO `um_role_info` VALUES (null, '2017090814440000000002', '业务查询', '1', '业务查询', 'plms', null, null, null, null);
INSERT INTO `um_role_info` VALUES (null, '2017090814440000000003', '风控逾期管理', '1', '风控逾期管理', 'plms', null, null, null, null);
INSERT INTO `um_role_info` VALUES (null, '2017090814440000000004', '财务查询', '1', '财务查询', 'plms', null, null, null, null);
INSERT INTO `um_role_info` VALUES (null, '2017090814440000000005', '还款登记复核', '1', '还款登记复核', 'plms', null, null, null, null);
INSERT INTO `um_role_info` VALUES (null, '2017090814440000000006', '运营管理', '1', '运营管理', 'plms', null, null, null, null);
INSERT INTO `um_role_info` VALUES (null, '2017090814440000000007', '还款登记', '1', '还款登记', 'plms', null, null, null, null);

-- 增加用户角色关系
INSERT INTO `um_user_role` VALUES (null, '2017090810570000000042', '2017071914440000000001', '1', null, null, null, null);

-- ----------------------------
-- um菜单信息表
-- ----------------------------
INSERT INTO `um_menu_info` VALUES (null, '2017090814440000000001', '个人中心', null, '1', '个人中心', './main', 'plms', '2017-07-03 14:10:36', '2017-07-05 03:29:45', null, null);
INSERT INTO `um_menu_info` VALUES (null, '2017090814440000000002', '待办任务', '2017090814440000000001', '1', '待办任务', './gtasks', 'plms', '2017-07-03 14:10:36', '2017-07-05 03:29:45', null, null);
INSERT INTO `um_menu_info` VALUES (null, '2017090814440000000003', '消息通知', '2017090814440000000001', '1', '消息通知', './message', 'plms', '2017-07-03 14:10:36', '2017-07-05 03:29:45', null, null);
INSERT INTO `um_menu_info` VALUES (null, '2017090814440000000004', '修改密码', '2017090814440000000001', '1', '修改密码', './ChangePsw', 'plms', '2017-07-03 14:10:36', '2017-07-05 03:29:45', null, null);

-- ----------------------------
-- um角色菜单关系表
-- ----------------------------
-- 给超级管理员补充新增的菜单权限
INSERT INTO `um_menu_role` VALUES (null, '2017090814440000000001', '2017071914440000000001', '1', '2017-07-03 17:55:57', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017090814440000000002', '2017071914440000000001', '1', '2017-07-03 18:09:04', '2017-07-03 18:09:04', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017090814440000000003', '2017071914440000000001', '1', '2017-07-03 18:09:04', '2017-07-03 18:09:04', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017090814440000000004', '2017071914440000000001', '1', '2017-07-03 18:09:04', '2017-07-03 18:09:04', null, null);

-- 默认角色
INSERT INTO `um_menu_role` VALUES (null, '2017090814440000000001', '2017090814440000000001', '1', '2017-07-03 17:55:57', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017090814440000000002', '2017090814440000000001', '1', '2017-07-03 18:09:04', '2017-07-03 18:09:04', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017090814440000000003', '2017090814440000000001', '1', '2017-07-03 18:09:04', '2017-07-03 18:09:04', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017090814440000000004', '2017090814440000000001', '1', '2017-07-03 18:09:04', '2017-07-03 18:09:04', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017071914440000000001', '2017090814440000000001', '1', '2017-07-03 18:09:04', '2017-07-03 18:09:04', null, null);

-- 业务查询角色
INSERT INTO `um_menu_role` VALUES (null, '2017072814440000000001', '2017090814440000000002', '1', '2017-07-03 17:55:57', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017072814440000000002', '2017090814440000000002', '1', '2017-07-03 17:55:57', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017073114440000000003', '2017090814440000000002', '1', '2017-07-03 17:55:57', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017080714510000000006', '2017090814440000000002', '1', '2017-07-03 17:55:57', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017080714510000000007', '2017090814440000000002', '1', '2017-07-03 17:55:57', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017080714510000000008', '2017090814440000000002', '1', '2017-07-03 17:55:57', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017080714510000000009', '2017090814440000000002', '1', '2017-07-03 17:55:57', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017080714510000000010', '2017090814440000000002', '1', '2017-07-03 17:55:57', '2017-07-03 18:04:45', null, null);

-- 风控逾期管理角色
INSERT INTO `um_menu_role` VALUES (null, '2017072814440000000001', '2017090814440000000003', '1', '2017-07-03 17:55:57', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017080714510000000010', '2017090814440000000003', '1', '2017-07-03 17:55:57', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017080714510000000008', '2017090814440000000003', '1', '2017-07-03 17:55:57', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017080714510000000007', '2017090814440000000003', '1', '2017-07-03 17:55:57', '2017-07-03 18:04:45', null, null);

-- 财务查询角色
INSERT INTO `um_menu_role` VALUES (null, '2017072814440000000001', '2017090814440000000004', '1', '2017-07-03 17:55:57', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017073114440000000003', '2017090814440000000004', '1', '2017-07-03 17:55:57', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017080714510000000008', '2017090814440000000004', '1', '2017-07-03 17:55:57', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017080714510000000009', '2017090814440000000004', '1', '2017-07-03 17:55:57', '2017-07-03 18:04:45', null, null);

-- 还款登记复核角色
INSERT INTO `um_menu_role` VALUES (null, '2017080714510000000003', '2017090814440000000005', '1', '2017-07-03 17:55:57', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017080714510000000005', '2017090814440000000005', '1', '2017-07-03 17:55:57', '2017-07-03 18:04:45', null, null);

-- 运营管理角色
INSERT INTO `um_menu_role` VALUES (null, '2017073114510000000001', '2017090814440000000006', '1', '2017-07-03 17:55:57', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017073114510000000002', '2017090814440000000006', '1', '2017-07-03 17:55:57', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017080714510000000002', '2017090814440000000006', '1', '2017-07-03 17:55:57', '2017-07-03 18:04:45', null, null);

-- 还款登记角色
INSERT INTO `um_menu_role` VALUES (null, '2017080714510000000003', '2017090814440000000007', '1', '2017-07-03 17:55:57', '2017-07-03 18:04:45', null, null);
INSERT INTO `um_menu_role` VALUES (null, '2017080714510000000004', '2017090814440000000007', '1', '2017-07-03 17:55:57', '2017-07-03 18:04:45', null, null);

